# 职业和流派的映射关系
SCHOOLS_MAP = {
    (0, 1): "魔导", (1, 1): "火术士", (2, 1): "冰法师",
    (0, 2): "弓手", (1, 2): "神射手", (2, 2): "风语者",
    (0, 3): "圣言", (1, 3): "审判者", (2, 3): "白贤者",
    (0, 4): "剑骑士", (1, 4): "守护者", (2, 4): "毁灭者",
    (0, 5): "隐刺", (1, 5): "瞬杀者", (2, 5): "影舞者",
    (0, 6): "格斗家", (1, 6): "阿修罗", (2, 6): "气功师",
    (0, 7): "枪手", (1, 7): "枪炮师", (2, 7): "指挥官",
    (0, 8): "战锤", (1, 8): "终结者", (2, 8): "征服者",
    (0, 9): "行者", (1, 9): "炎斗流", (2, 9): "幻武流",
    (0, 10): "噬魂", (1, 10): "虹吸流", (2, 10): "献祭流",
    (0, 11): "驯兽师", (1, 11): "万兽王", (2, 11): "通灵王"
}

# 玩法名称映射
GAME_MODES = {
    "season_play_pvp_mgr": "赛季玩法",
    "test_pvp2": "赏金玩法(未开放)",
    "test_pvp3": "武道会玩法(未开放)"
} 